app/views/cart/createOrder.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = 1 LIMIT ?  [["LIMIT", 1]]
---
      <tr>
        <% item = Orderitem.find_by_id(id) %>