app/views/cart/index.html.erb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <% @cart.each do |id, quantity| %>
          <% item = Item.find_by_id(id) %>