app/controllers/items_controller.rb

INSERT INTO "items" ("title", "description", "price", "image_url", "category", "brand", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "title" = ?, "description" = ?, "price" = ?, "category" = ?, "brand" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["title", "Cereal"], ["description", "Breakfast cereals"], ["price", 4.0], ["category", "Dry foods"], ["brand", "Yellow Pack"], ["updated_at", "2020-05-17 13:32:44.461415"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT "items".* FROM "items" WHERE (title like '%Tin of Tuna%')
---
    def search
     st = "%#{params[:q]}%"
     @items = Item.where("title like ?", st)