app/controllers/static_pages_controller.rb

SELECT "categories".* FROM "categories"
---
  def home
   @categories = Category.all

SELECT "items".* FROM "items" WHERE (category like'Clonmethan_Lodge_Oldtown')
---
  def category
  catName = params[:title]
    @items = Item.where("category like?", catName)